blog-posts/2005-06-09-automatically-scheduling-tasks-onto-taskpool.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Automatically scheduling tasks onto TaskPool</title>
<!-- 2014-04-30 Wed 17:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Automatically scheduling tasks onto TaskPool</h1>
<p>
June 9th, 2005 -
<a href="http://sachachua.com/blog/p/2776"><a href="http://sachachua.com/blog/p/2776">http://sachachua.com/blog/p/2776</a></a>
</p>

<pre class="example">
(defadvice planner-create-task-from-buffer (before paul activate)
  "Automatically schedule task onto TaskPool as well as other projects."
  (if plan-page
      (unless (string-match plan-page "TaskPool")
        (setq plan-page (concat plan-page planner-multi-separator "TaskPool")))
    (setq plan-page "TaskPool")))
</pre>

<p>
Here's another snippet that will unschedule tasks from
<a href="http://sachachua.com/notebook/wiki/TaskPool">TaskPool</a> when
 you mark them completed with C-c C-x (planner-task-done). Nifty stuff,
 huh?
</p>

<pre class="example">
(defadvice planner-task-done (after paul activate)
  "Remove completed tasks from the TaskPool if that still leaves them linked."
  (let ((info (planner-current-task-info)))
    (when (planner-task-link-text info)
      ;; If it is linked to TaskPool _and_ at least one other thing
      (if (string-match planner-multi-separator (planner-task-link-text info))
          (planner-multi-replan-task
           (planner-multi-make-link (planner-multi-filter-links "^TaskPool$" (planner-multi-task-link-as-list info) t)))
        ;; Else if it has a date and is linked to TaskPool
        (if (and (planner-task-date info)
                 (string= (planner-task-link info) "TaskPool"))
            (planner-replan-task nil))))))
</pre>

<p>
ÃƒÂ¥Ã‚ÂŽÃ‚ÂŸÃƒÂ¥Ã‚Â§Ã‚Â‹ÃƒÂ§Ã‚ÂšÃ‚Â„ÃƒÂ£Ã‚Â?Ã‚ÂªÃƒÂ¨Ã‚Â¨Ã‚ÂˆÃƒÂ§Ã‚Â®Ã‚Â&#x2014;ÃƒÂ¦Ã‚Â©Ã‚ÂŸÃƒÂ£Ã‚Â?Ã‚ÂŒÃƒÂ£Ã‚Â€Ã‚Â?ÃƒÂ£Ã‚Â‚Ã‚Â³ÃƒÂ£Ã‚ÂƒÃ‚Â³ÃƒÂ£Ã‚ÂƒÃ‚Â”ÃƒÂ£Ã‚ÂƒÃ‚Â¥ÃƒÂ£Ã‚ÂƒÃ‚Â¼ÃƒÂ£Ã‚Â‚Ã‚Â¿ÃƒÂ£Ã‚ÂƒÃ‚Â¼ÃƒÂ£Ã‚Â?Ã‚Â®ÃƒÂ©Ã‚Â&#x2013;Ã‚Â‹ÃƒÂ§Ã‚Â™Ã‚ÂºÃƒÂ£Ã‚Â?Ã‚Â•ÃƒÂ£Ã‚Â‚Ã‚ÂŒÃƒÂ£Ã‚Â‚Ã‚Â‹ÃƒÂ£Ã‚Â?Ã‚ÂšÃƒÂ£Ã‚Â?Ã‚Â£ÃƒÂ£Ã‚Â?Ã‚Â¨ÃƒÂ¤Ã‚Â»Ã‚Â¥ÃƒÂ¥Ã‚Â‰Ã‚Â?ÃƒÂ£Ã‚Â?Ã‚Â«ÃƒÂ¥Ã‚Â­Ã‚Â˜ÃƒÂ¥Ã‚ÂœÃ‚Â¨ÃƒÂ£Ã‚Â?Ã‚Â&#x2014;ÃƒÂ£Ã‚Â?Ã‚Â¦ÃƒÂ£Ã‚Â?Ã‚Â„ÃƒÂ£Ã‚Â?Ã‚ÂŸÃƒÂ£Ã‚Â€Ã‚Â‚
Primitive calculating machines existed long before computers were
developed.
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/planner">planner</a>,
<a href="http://www.technorati.com/tag/emacs">emacs</a>,
<a href="http://www.technorati.com/tag/code">code</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
